amarildolacerda/homeware/clients/esp8266_pir/src/main.cpp
    console.printf("\n");
    console.printf("============================================\n");
    console.printf("  ESP8266 PIR Sensor " FW_VERSION "\n");
    console.printf("  Device: %s\n", s_device_id);
    console.printf("  Nome:   %s\n", s_device_name);
    console.printf("============================================\n");

    randomSeed(analogRead(A0));
    init_hardware();
    console.printf("============================================\n");

    if (!wifi_setup(false))
    {
        console.printf("[%s] WiFi setup failed, restarting...\n", TAG);
        delay(5000);
        ESP.restart();
    }

    espnow_init_client();
    WiFi.macAddress(s_my_mac);

    s_server.on("/", handle_root);
    s_server.on("/docs", []() { serve_pgm_page(PAGE_DOCS); });
    s_server.on("/api/state", handle_api_state);
    s_server.on("/api/settings", HTTP_ANY, handle_api_settings);
    s_server.on("/api/pin", handle_api_pin);
    s_server.on("/api/ota", HTTP_POST, handle_ota, handle_ota_upload);
    s_server.begin();

    ArduinoOTA.setHostname(s_device_id);
    ArduinoOTA.onStart([]() { console.printf("[%s] OTA update start\n", TAG); });
    ArduinoOTA.onEnd([]() { console.printf("[%s] OTA update end\n", TAG); });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        console.printf("[%s] OTA progress: %u%%\r", TAG, (progress * 100) / total);
    });
    ArduinoOTA.onError([](ota_error_t error) {
        console.printf("[%s] OTA error: %d\n", TAG, error);
    });
    ArduinoOTA.begin();
    console.printf("[%s] OTA ready: %s.local\n", TAG, s_device_id);

    console.printf("\n  => Browser: http://%s\n", WiFi.localIP().toString().c_str());
    console.printf("  => Terminal: 'h' comando de ajuda\n");

    if (load_gateway_mac())
    {
        console.printf("[%s] Gateway MAC loaded from EEPROM\n", TAG);
        s_paired = true;
    }
    else
    {
        console.printf("[%s] No saved gateway MAC, will pair\n", TAG);
    }

    console.printf("============================================\n");
    console.printf("  Pronto! Pressione 'h' para ajuda\n");
    console.printf("============================================\n\n");
}

void loop(void)
{
    console.loop();
    if (Serial.available() > 0)
        handle_serial(Serial.read());
    int tc = console.telnet_read();
    if (tc >= 0)
        handle_serial((char)tc);
    check_config_portal_timeout();
    ArduinoOTA.handle();
    s_server.handleClient();

    if (WiFi.status() != WL_CONNECTED)
    {
        maintain_wifi_connection();
        return;
    }

    unsigned long now = millis();

    read_pir();

    if (!s_paired)
    {
        if (now < s_pair_cooldown_end)
            return;
        if (now - s_last_espnow_pair > ESPNOW_PAIR_INTERVAL_MS)
        {
            s_last_espnow_pair = now;
            s_pair_attempts++;
            console.printf("[%s] Pair attempt %d/%d\n", TAG, s_pair_attempts, ESPNOW_MAX_PAIR_ATTEMPTS);
            espnow_send_pair_request();
            if (s_pair_attempts >= ESPNOW_MAX_PAIR_ATTEMPTS)
            {
                s_pair_attempts = 0;
                s_pair_cooldown_end = now + 60000;
                console.printf("[%s] Max pair attempts, cooldown 60s\n", TAG);
            }
        }
        return;
    }

    switch (s_send_state)
    {
    case SEND_IDLE:
        if (now - s_last_espnow_send > STATE_UPDATE_INTERVAL)
        {
            s_last_espnow_send = now;
            s_ack_received = false;
            if (espnow_send_data())
            {
                s_send_state = SEND_WAIT_ACK;
                s_ack_deadline = now + ESPNOW_ACK_TIMEOUT_MS;
            }
        }
        break;

    case SEND_WAIT_ACK:
        if (s_ack_received)
        {
            s_gateway_connected = true;
            s_last_send_ms = millis();
            s_send_state = SEND_IDLE;
            s_retry_count = 0;
        }
        else if (now >= s_ack_deadline)
        {
            s_gateway_connected = false;
            if (s_retry_count < ESPNOW_SEND_RETRIES)
            {
                s_retry_count++;
                s_send_state = SEND_RETRY_DELAY;
                s_retry_deadline = now + 50;
            }
            else
            {
                console.printf("[%s] Send failed after %d retries, re-pairing\n", TAG, s_retry_count);
                s_paired = false;
                s_pair_attempts = 0;
                s_last_espnow_pair = 0;
                s_send_state = SEND_IDLE;
                s_retry_count = 0;
            }
        }
        break;

    case SEND_RETRY_DELAY:
        if (now >= s_retry_deadline)
        {
            s_ack_received = false;
            if (espnow_send_data())
            {
                s_send_state = SEND_RETRY_WAIT_ACK;
                s_ack_deadline = now + ESPNOW_ACK_TIMEOUT_MS;
            }
            else
            {
                s_send_state = SEND_IDLE;
                s_retry_count = 0;
            }
        }
        break;

    case SEND_RETRY_WAIT_ACK:
        if (s_ack_received)
        {
            s_gateway_connected = true;
            s_last_send_ms = millis();
            s_send_state = SEND_IDLE;
            s_retry_count = 0;
        }
        else if (now >= s_ack_deadline)
        {
            if (s_retry_count < ESPNOW_SEND_RETRIES)
            {
                s_retry_count++;
                s_send_state = SEND_RETRY_DELAY;
                s_retry_deadline = now + 50;
            }
            else
            {
                console.printf("[%s] Send failed after %d retries, re-pairing\n", TAG, s_retry_count);
                s_paired = false;
                s_pair_attempts = 0;
                s_last_espnow_pair = 0;
                s_send_state = SEND_IDLE;
                s_retry_count = 0;
            }
        }
        break;
    }

    if (now - s_last_heartbeat > HEARTBEAT_INTERVAL)
    {
        s_last_heartbeat = now;
        console.printf("[%s] RSSI=%d dBm  up=%lus\n", TAG, WiFi.RSSI(), (millis() - s_start_time) / 1000);
        if (s_paired)
            espnow_send_heartbeat();
    }

#ifdef LED_PIN
    static unsigned long last_led = 0;
    if (s_wifi_configuration_mode)
    {
        digitalWrite(LED_PIN, HIGH);
    }
    else if (WiFi.status() != WL_CONNECTED)
    {
        if (now - last_led >= LED_BLINK_WIFI_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else if (!s_paired)
    {
        if (now - last_led >= LED_BLINK_GATEWAY_MS)
        {
            last_led = now;
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
        }
    }
    else
    {
        digitalWrite(LED_PIN, LOW);
    }
#endif
}
